In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('seg.csv')

In [3]:
df

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10-01-1994,F,JAMSHEDPUR,17819.05,02-08-2016,143207.0,25.0
1,T2,C2142763,04-04-1957,M,JHAJJAR,2270.69,02-08-2016,141858.0,27999.0
2,T3,C4417068,26-11-1996,F,MUMBAI,17874.44,02-08-2016,142712.0,459.0
3,T4,C5342380,14-09-1973,F,MUMBAI,866503.21,02-08-2016,142714.0,2060.0
4,T5,C9031234,24-03-1988,F,NAVI MUMBAI,6714.43,02-08-2016,181156.0,1762.5
...,...,...,...,...,...,...,...,...,...
875570,T875571,C2131177,03-09-1997,M,ROHTAK,19.27,07-09-2016,222956.0,74.0
875571,T875572,C1019311,26-02-1991,M,SECUNDERABAD,24060.39,07-09-2016,223023.0,688.0
875572,T875573,C4413592,13-07-1992,M,NAVI MUMBAI,16638.79,07-09-2016,223026.0,2520.0
875573,T875574,C4813976,10-07-1983,M,GURGAON,51521.26,07-09-2016,223027.0,683.0
875574,T875575,C1935147,27-11-1996,M,NaN,NaN,NaN,NaN,NaN

In [4]:
df.dtypes

TransactionID               object
CustomerID                  object
CustomerDOB                 object
CustGender                  object
CustLocation                object
CustAccountBalance         float64
TransactionDate             object
TransactionTime            float64
TransactionAmount (INR)    float64
dtype: object

In [6]:
df.isnull().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                2846
CustGender                  934
CustLocation                131
CustAccountBalance         2101
TransactionDate               1
TransactionTime               1
TransactionAmount (INR)       1
dtype: int64

In [7]:
df.shape

(875575, 9)

In [8]:
df1=df.dropna()

In [9]:
df1.shape

(869606, 9)

In [10]:
df1.isna().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
dtype: int64

In [14]:
df1['CustomerDOB'] = pd.to_datetime(df1['CustomerDOB'], dayfirst=True,format='mixed')
df1['Age'] = (pd.to_datetime('today') - df1['CustomerDOB']).dt.days // 365
df1

<ipython-input-14-a2295b1f233f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['CustomerDOB'] = pd.to_datetime(df1['CustomerDOB'], dayfirst=True,format='mixed')
<ipython-input-14-a2295b1f233f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Age'] = (pd.to_datetime('today') - df1['CustomerDOB']).dt.days // 365

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age
0,T1,C5841053,1994-01-10,F,JAMSHEDPUR,17819.05,02-08-2016,143207.0,25.0,31
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,02-08-2016,141858.0,27999.0,67
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,02-08-2016,142712.0,459.0,28
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,02-08-2016,142714.0,2060.0,51
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,02-08-2016,181156.0,1762.5,36
...,...,...,...,...,...,...,...,...,...,...
875569,T875570,C3711315,1984-03-01,M,BANGALORE,2049.25,07-09-2016,223528.0,400.0,40
875570,T875571,C2131177,1997-09-03,M,ROHTAK,19.27,07-09-2016,222956.0,74.0,27
875571,T875572,C1019311,1991-02-26,M,SECUNDERABAD,24060.39,07-09-2016,223023.0,688.0,33
875572,T875573,C4413592,1992-07-13,M,NAVI MUMBAI,16638.79,07-09-2016,223026.0,2520.0,32
875573,T875574,C4813976,1983-07-10,M,GURGAON,51521.26,07-09-2016,223027.0,683.0,41

In [17]:
df1.isna().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
Age                        0
dtype: int64

In [ ]:
Age Analysis

In [23]:
import matplotlib.pyplot as plt

Matplotlib is building the font cache; this may take a moment.

In [31]:
df1.info

<bound method DataFrame.info of        TransactionID CustomerID CustomerDOB CustGender  CustLocation  \
0                 T1   C5841053  1994-01-10          F    JAMSHEDPUR
1                 T2   C2142763  1957-04-04          M       JHAJJAR
2                 T3   C4417068  1996-11-26          F        MUMBAI
3                 T4   C5342380  1973-09-14          F        MUMBAI
4                 T5   C9031234  1988-03-24          F   NAVI MUMBAI
...              ...        ...         ...        ...           ...
875569       T875570   C3711315  1984-03-01          M     BANGALORE
875570       T875571   C2131177  1997-09-03          M        ROHTAK
875571       T875572   C1019311  1991-02-26          M  SECUNDERABAD
875572       T875573   C4413592  1992-07-13          M   NAVI MUMBAI
875573       T875574   C4813976  1983-07-10          M       GURGAON

        CustAccountBalance TransactionDate  TransactionTime  \
0                 17819.05      02-08-2016         143207.0
1                  2270.69      02-08-2016         141858.0
2                 17874.44      02-08-2016         142712.0
3                866503.21      02-08-2016         142714.0
4                  6714.43      02-08-2016         181156.0
...                    ...             ...              ...
875569             2049.25      07-09-2016         223528.0
875570               19.27      07-09-2016         222956.0
875571            24060.39      07-09-2016         223023.0
875572            16638.79      07-09-2016         223026.0
875573            51521.26      07-09-2016         223027.0

        TransactionAmount (INR)  Age
0                          25.0   31
1                       27999.0   67
2                         459.0   28
3                        2060.0   51
4                        1762.5   36
...                         ...  ...
875569                    400.0   40
875570                     74.0   27
875571                    688.0   33
875572                   2520.0   32
875573                    683.0   41

[869606 rows x 10 columns]>

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 869606 entries, 0 to 875573
Data columns (total 10 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   TransactionID            869606 non-null  object
 1   CustomerID               869606 non-null  object
 2   CustomerDOB              869606 non-null  datetime64[ns]
 3   CustGender               869606 non-null  object
 4   CustLocation             869606 non-null  object
 5   CustAccountBalance       869606 non-null  float64
 6   TransactionDate          869606 non-null  object
 7   TransactionTime          869606 non-null  float64
 8   TransactionAmount (INR)  869606 non-null  float64
 9   Age                      869606 non-null  int64
dtypes: datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 56.4+ MB

In [35]:
df1.describe()

,CustomerDOB,CustAccountBalance,TransactionTime,TransactionAmount (INR),Age
count,869606,8.696060e+05,869606.000000,8.696060e+05,869606.000000
mean,1975-05-18 08:50:13.083166464,1.148167e+05,157241.654920,1.578306e+03,49.225953
min,1800-01-01 00:00:00,0.000000e+00,0.000000,0.000000e+00,-5.000000
25%,1980-07-08 00:00:00,4.701360e+03,124145.000000,1.610000e+02,33.000000
50%,1987-03-23 00:00:00,1.680968e+04,164426.000000,4.600000e+02,37.000000
75%,1991-02-14 00:00:00,5.758374e+04,200101.000000,1.200000e+03,44.000000
max,2029-12-19 00:00:00,1.150355e+08,235959.000000,1.560035e+06,225.000000
std,NaN,8.101808e+05,51276.367715,6.673696e+03,43.010993

In [ ]:
age based clusters

In [45]:
import pandas as pd
def age_group(age):
    if age < 25:
        return 'Young Adult (<25)'
    elif 25 <= age < 40:
        return 'Mid-Aged (25-40)'
    elif 40 <= age < 60:
        return 'Older Adult (40-60)'
    else:
        return 'Senior (60+)'
df1['AgeGroup'] = df1['Age'].apply(age_group)
print(df1[['CustomerID', 'Age', 'AgeGroup']])

<ipython-input-45-b04357a5c932>:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['AgeGroup'] = df1['Age'].apply(age_group)

       CustomerID  Age             AgeGroup
0        C5841053   31     Mid-Aged (25-40)
1        C2142763   67         Senior (60+)
2        C4417068   28     Mid-Aged (25-40)
3        C5342380   51  Older Adult (40-60)
4        C9031234   36     Mid-Aged (25-40)
...           ...  ...                  ...
875569   C3711315   40  Older Adult (40-60)
875570   C2131177   27     Mid-Aged (25-40)
875571   C1019311   33     Mid-Aged (25-40)
875572   C4413592   32     Mid-Aged (25-40)
875573   C4813976   41  Older Adult (40-60)

[869606 rows x 3 columns]

In [46]:
transaction_frequency_by_age = df1.groupby('AgeGroup').size().reset_index(name='TransactionFrequency')
print(transaction_frequency_by_age)

              AgeGroup  TransactionFrequency
0     Mid-Aged (25-40)                523787
1  Older Adult (40-60)                267547
2         Senior (60+)                 77401
3    Young Adult (<25)                   871

In [ ]:
gender based cluster

In [49]:
df1.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age,AgeGroup
0,T1,C5841053,1994-01-10,F,JAMSHEDPUR,17819.05,02-08-2016,143207.0,25.0,31,Mid-Aged (25-40)
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,02-08-2016,141858.0,27999.0,67,Senior (60+)
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,02-08-2016,142712.0,459.0,28,Mid-Aged (25-40)
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,02-08-2016,142714.0,2060.0,51,Older Adult (40-60)
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,02-08-2016,181156.0,1762.5,36,Mid-Aged (25-40)

In [50]:
transaction_frequency_by_gender = df1.groupby('CustGender').size().reset_index(name='TransactionFrequency')

In [51]:
transaction_frequency_by_gender

  CustGender  TransactionFrequency
0          F                234994
1          M                634612

In [52]:
transaction_frequency_by_location = df1.groupby('CustLocation').size().reset_index(name='TransactionFrequency')

In [53]:
transaction_frequency_by_location

                        CustLocation  TransactionFrequency
0           (154) BHASKOLA FARIDABAD                     8
1         (BEFORE YMCA BLDG) CHENNAI                     1
2            (BENAKA MDTS) BANGALORE                    21
3              (BRINDA BAN ) KOLKATA                     4
4                         (DT) HOSUR                    11
...                              ...                   ...
8816       ZONE WHITEFIELD BANGALORE                    37
8817  ZOPADPATTI TEHSIL KURLA MUMBAI                     1
8818                      ZUARINAGAR                     6
8819                  ZUMARI TILAIYA                     8
8820                       ZUNHEBOTO                     1

[8821 rows x 2 columns]

In [54]:
transaction_frequency_by_location = transaction_frequency_by_location.sort_values(by='TransactionFrequency', ascending=False)

In [55]:
transaction_frequency_by_location

              CustLocation  TransactionFrequency
4967                MUMBAI                 85618
5457             NEW DELHI                 70444
730              BANGALORE                 68407
2906               GURGAON                 61521
1941                 DELHI                 58537
...                    ...                   ...
1640          CHUVACHANPUR                     1
6006    PASHCHIM CHAMPARAN                     1
6008  PASSPORT OFFICE PUNE                     1
6009     PASWADA GHAZIABAD                     1
8820             ZUNHEBOTO                     1

[8821 rows x 2 columns]

In [56]:
transaction_frequency_by_gender_location = df1.groupby(['CustGender', 'CustLocation']).size().reset_index(name='TransactionFrequency')

In [57]:
transaction_frequency_by_gender_location

      CustGender                    CustLocation  TransactionFrequency
0              F        (154) BHASKOLA FARIDABAD                     8
1              F                      (E) MUMBAI                     6
2              F                   (EAST) MUMBAI                     7
3              F                 (MOHALI) KHARAR                    10
4              F           (PITAMPURA) NEW DELHI                     2
...          ...                             ...                   ...
10361          M                        ZIRAKPUR                  1161
10362          M               ZIRAKPUR ZIRAKPUR                     8
10363          M                         ZIRKPUR                     7
10364          M  ZOPADPATTI TEHSIL KURLA MUMBAI                     1
10365          M                      ZUARINAGAR                     6

[10366 rows x 3 columns]

In [58]:
transaction_frequency_by_gender_location = transaction_frequency_by_gender_location.sort_values(by='TransactionFrequency', ascending=False)

In [59]:
transaction_frequency_by_gender_location

     CustGender                 CustLocation  TransactionFrequency
7117          M                       MUMBAI                 58591
7535          M                    NEW DELHI                 49999
3519          M                    BANGALORE                 48173
5362          M                      GURGAON                 40445
4548          M                        DELHI                 40351
...         ...                          ...                   ...
5446          M                      HARSOLI                     1
8708          M      SADARAMANGALA BANGALORE                     1
5445          M                       HARSAN                     1
1449          F               MADHYA PRADESH                     1
6542          M  LAYOUT 2ND SECTOR BANGALORE                     1

[10366 rows x 3 columns]

In [ ]:
account balance cluster

In [64]:
q25 = df['CustAccountBalance'].quantile(0.25)
q50 = df['CustAccountBalance'].quantile(0.50)  # This is the median
q75 = df['CustAccountBalance'].quantile(0.75)
q100=df['CustAccountBalance'].max()

In [61]:
q25

np.float64(4698.0)

In [62]:
q50

np.float64(16839.53)

In [63]:
q75

np.float64(57821.23)

In [65]:
q100

np.float64(115035495.1)

In [67]:
def CustAccountBalance_group(CustAccountBalance):
    if CustAccountBalance < 4698.0:
        return 'inactive'
    elif 4698.0 <= CustAccountBalance <16839.53:
        return 'Mid-Active'
    elif 16839.53 <= CustAccountBalance <57821.23:
        return 'Active'
    else:
        return 'Super Active'
df1['CustAccountBalance_group'] = df1['CustAccountBalance'].apply(CustAccountBalance_group)

transaction_frequency_by_balance = df1.groupby('CustAccountBalance_group').size().reset_index(name='TransactionFrequency')
print(transaction_frequency_by_balance)

<ipython-input-67-99a726a1571c>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['CustAccountBalance_group'] = df1['CustAccountBalance'].apply(CustAccountBalance_group)

  CustAccountBalance_group  TransactionFrequency
0                   Active                217703
1               Mid-Active                217874
2             Super Active                216800
3                 inactive                217229

In [69]:
balance_frequency_by_location = df1.groupby(['CustLocation', 'CustAccountBalance_group']).size().reset_index(name='AccountFrequency')

In [70]:
balance_frequency_by_location

,CustLocation,CustAccountBalance_group,AccountFrequency
0,(154) BHASKOLA FARIDABAD,Active,8
1,(BEFORE YMCA BLDG) CHENNAI,inactive,1
2,(BENAKA MDTS) BANGALORE,inactive,21
3,(BRINDA BAN ) KOLKATA,Mid-Active,4
4,(DT) HOSUR,Mid-Active,8
...,...,...,...
13061,ZONE WHITEFIELD BANGALORE,Active,37
13062,ZOPADPATTI TEHSIL KURLA MUMBAI,Active,1
13063,ZUARINAGAR,Active,6
13064,ZUMARI TILAIYA,Super Active,8
13065,ZUNHEBOTO,Active,1

In [71]:
p25 = df['TransactionTime'].quantile(0.25)
p50 = df['TransactionTime'].quantile(0.50)  # This is the median
p75 = df['TransactionTime'].quantile(0.75)
p100=df['TransactionTime'].max()

In [72]:
p25

np.float64(124134.0)

In [73]:
p50

np.float64(164404.0)

In [74]:
p75

np.float64(200050.0)

In [75]:
p100

np.float64(235959.0)

In [76]:
def TransactionTime_group(TransactionTime):
    if TransactionTime < 124134.0:
        return 'Very Low'
    elif 124134.0 <= TransactionTime <164404.0:
        return 'Low'
    elif 164404.0 <= TransactionTime <200050.0:
        return 'high'
    else:
        return 'Super high'

df1['TransactionTime_group'] = df1['TransactionTime'].apply(TransactionTime_group)

transaction_frequency_by_time = df1.groupby('TransactionTime_group').size().reset_index(name='TransactionFrequency')

print(transaction_frequency_by_time)

<ipython-input-76-419d8f7ea4eb>:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['TransactionTime_group'] = df1['TransactionTime'].apply(TransactionTime_group)

  TransactionTime_group  TransactionFrequency
0                   Low                217218
1            Super high                217664
2              Very Low                217247
3                  high                217477

In [77]:
trans_frequency_by_location = df1.groupby(['CustLocation', 'TransactionTime_group']).size().reset_index(name='AccountFrequency')

In [78]:
trans_frequency_by_location

                     CustLocation TransactionTime_group  AccountFrequency
0        (154) BHASKOLA FARIDABAD                   Low                 3
1        (154) BHASKOLA FARIDABAD            Super high                 3
2        (154) BHASKOLA FARIDABAD                  high                 2
3      (BEFORE YMCA BLDG) CHENNAI                   Low                 1
4         (BENAKA MDTS) BANGALORE                   Low                 4
...                           ...                   ...               ...
22270                  ZUARINAGAR                  high                 1
22271              ZUMARI TILAIYA            Super high                 2
22272              ZUMARI TILAIYA              Very Low                 1
22273              ZUMARI TILAIYA                  high                 5
22274                   ZUNHEBOTO                  high                 1

[22275 rows x 3 columns]

In [82]:
trans_frequency_by_location = trans_frequency_by_location.sort_values(by='AccountFrequency', ascending=False)

In [83]:
trans_frequency_by_location

               CustLocation TransactionTime_group  AccountFrequency
12530                MUMBAI            Super high             24701
12529                MUMBAI                   Low             21137
12531                MUMBAI              Very Low             19919
12532                MUMBAI                  high             19861
13773             NEW DELHI              Very Low             18324
...                     ...                   ...               ...
14915             PAPUMPARE                  high                 1
14916  PAPUMPARE NAHARLAGUN                  high                 1
14917          PARA KOLKATA                   Low                 1
14919              PARADEEP              Very Low                 1
22274             ZUNHEBOTO                  high                 1

[22275 rows x 3 columns]

In [84]:
df1

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),Age,AgeGroup,CustAccountBalance_group,TransactionTime_group
0,T1,C5841053,1994-01-10,F,JAMSHEDPUR,17819.05,02-08-2016,143207.0,25.0,31,Mid-Aged (25-40),Active,Low
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,02-08-2016,141858.0,27999.0,67,Senior (60+),inactive,Low
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,02-08-2016,142712.0,459.0,28,Mid-Aged (25-40),Active,Low
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,02-08-2016,142714.0,2060.0,51,Older Adult (40-60),Super Active,Low
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,02-08-2016,181156.0,1762.5,36,Mid-Aged (25-40),Mid-Active,high
...,...,...,...,...,...,...,...,...,...,...,...,...,...
875569,T875570,C3711315,1984-03-01,M,BANGALORE,2049.25,07-09-2016,223528.0,400.0,40,Older Adult (40-60),inactive,Super high
875570,T875571,C2131177,1997-09-03,M,ROHTAK,19.27,07-09-2016,222956.0,74.0,27,Mid-Aged (25-40),inactive,Super high
875571,T875572,C1019311,1991-02-26,M,SECUNDERABAD,24060.39,07-09-2016,223023.0,688.0,33,Mid-Aged (25-40),Active,Super high
875572,T875573,C4413592,1992-07-13,M,NAVI MUMBAI,16638.79,07-09-2016,223026.0,2520.0,32,Mid-Aged (25-40),Mid-Active,Super high
875573,T875574,C4813976,1983-07-10,M,GURGAON,51521.26,07-09-2016,223027.0,683.0,41,Older Adult (40-60),Active,Super high

In [85]:
import pandas as pd
from sklearn.preprocessing import StandardScaler


df1_encoded = pd.get_dummies(df1[['Age', 'CustAccountBalance_group', 'TransactionTime_group', 'TransactionAmount (INR)']], drop_first=True)

scaler = StandardScaler()
scaled_data = scaler.fit_transform(df1_encoded)
scaled_data = pd.DataFrame(scaled_data, columns=df1_encoded.columns)

In [86]:
scaled_data

,Age,TransactionAmount (INR),CustAccountBalance_group_Mid-Active,CustAccountBalance_group_Super Active,CustAccountBalance_group_inactive,TransactionTime_group_Super high,TransactionTime_group_Very Low,TransactionTime_group_high
0,-0.423751,-0.232751,-0.578187,-0.576285,-0.577045,-0.577815,-0.577077,-0.577484
1,0.413245,3.958932,-0.578187,-0.576285,1.732968,-0.577815,-0.577077,-0.577484
2,-0.493501,-0.167719,-0.578187,-0.576285,-0.577045,-0.577815,-0.577077,-0.577484
3,0.041246,0.072178,-0.578187,1.735252,-0.577045,-0.577815,-0.577077,-0.577484
4,-0.307502,0.027600,1.729545,-0.576285,-0.577045,-0.577815,-0.577077,1.731650
...,...,...,...,...,...,...,...,...
869601,-0.214502,-0.176560,-0.578187,-0.576285,1.732968,1.730658,-0.577077,-0.577484
869602,-0.516751,-0.225408,-0.578187,-0.576285,1.732968,1.730658,-0.577077,-0.577484
869603,-0.377252,-0.133405,-0.578187,-0.576285,-0.577045,1.730658,-0.577077,-0.577484
869604,-0.400501,0.141105,1.729545,-0.576285,-0.577045,1.730658,-0.577077,-0.577484
869605,-0.191252,-0.134155,-0.578187,-0.576285,-0.577045,1.730658,-0.577077,-0.577484

In [89]:
from sklearn.cluster import KMeans
n_clusters = 4
kmeans = KMeans(n_clusters=n_clusters, random_state=42)
df1['CustomerSegment'] = kmeans.fit_predict(scaled_data)

<ipython-input-89-a536874ad9e1>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['CustomerSegment'] = kmeans.fit_predict(scaled_data)

In [91]:
df1['CustomerSegment']

0         1
1         1
2         1
3         3
4         2
         ..
875569    1
875570    1
875571    2
875572    2
875573    2
Name: CustomerSegment, Length: 869606, dtype: int32

In [101]:

cluster_labels = {
    0: 'Inactive Customers',
    1: 'less active Customers',
    2: 'Mid-Value Customers',
    3: 'Super Active Customers'
}

df1['CustomerSegmentLabel'] = df1['CustomerSegment'].map(cluster_labels)
print(df1[['CustomerID', 'CustomerSegment', 'CustomerSegmentLabel']])

<ipython-input-101-3bab2aa4f494>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['CustomerSegmentLabel'] = df1['CustomerSegment'].map(cluster_labels)

       CustomerID  CustomerSegment    CustomerSegmentLabel
0        C5841053                1   less active Customers
1        C2142763                1   less active Customers
2        C4417068                1   less active Customers
3        C5342380                3  Super Active Customers
4        C9031234                2     Mid-Value Customers
...           ...              ...                     ...
875569   C3711315                1   less active Customers
875570   C2131177                1   less active Customers
875571   C1019311                2     Mid-Value Customers
875572   C4413592                2     Mid-Value Customers
875573   C4813976                2     Mid-Value Customers

[869606 rows x 3 columns]

In [100]:

cluster_counts = df1['CustomerSegment'].value_counts().reset_index()
cluster_counts.columns = ['CustomerSegment', 'CustomerCount']
print(cluster_counts)

   CustomerSegment  CustomerCount
0                1         356881
1                3         253889
2                2         211447
3                0          47389